src/erlang/tutorial/misc/misc.org
#+TITLE: 杂项
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_UP: ../fault-tolerance/fault-tolerance.html   
#+HTML_LINK_HOME: ../tutorial.html
#+OPTIONS: num:nil timestamp:nil ^:nil 

大型程序通常会把代码拆分成一组文件，各个文件之间通过良好定义的接口来连接 

* 拆分源码
  现在将前面几节中 messager 程序分布到多个文件中 
** 服务器配置头文件 

   #+begin_src erlang 
     %%%----FILE mess_config.hrl----

     %%% Configure the location of the server node,
     -define(server_node, messenger@gentoo).

     %%%----END FILE----
   #+end_src
** 客户端与 messager 之间的接口定义
   #+begin_src erlang 
     %%%----FILE mess_interface.hrl----

     %%%Message interface between client and server and client shell for
     %%% messenger program 

     %%%Messages from Client to server received in server/1 function.
     -record(logon,{client_pid, username}).
     -record(message,{client_pid, to_name, message}).
     %%% {'EXIT', ClientPid, Reason}  (client terminated or unreachable.

     %%% Messages from Server to Client, received in await_result/0 function 
     -record(abort_client,{message}).
     %%% Messages are: user_exists_at_other_node, 
     %%%               you_are_not_logged_on
     -record(server_reply,{message}).
     %%% Messages are: logged_on
     %%%               receiver_not_found
     %%%               sent  (Message has been sent (no guarantee)
     %%% Messages from Server to Client received in client/1 function
     -record(message_from,{from_name, message}).

     %%% Messages from shell to Client received in client/1 function
     %%% spawn(mess_client, client, [server_node(), Name])
     -record(message_to,{to_name, message}).
     %%% logoff

     %%%----END FILE----
   #+end_src
** 用户接口函数

   #+begin_src erlang 
  %%%----FILE user_interface.erl----

  %%% User interface to the messenger program
  %%% login(Name)
  %%%     One user at a time can log in from each Erlang node in the
  %%%     system messenger: and choose a suitable Name. If the Name
  %%%     is already logged in at another node or if someone else is
  %%%     already logged in at the same node, login will be rejected
  %%%     with a suitable error message.

  %%% logoff()
  %%%     Logs off anybody at that node

  %%% message(ToName, Message)
  %%%     sends Message to ToName. Error messages if the user of this 
  %%%     function is not logged on or if ToName is not logged on at
  %%%     any node.

  -module(user_interface).
  -export([logon/1, logoff/0, message/2]).
  -include("mess_interface.hrl").
  -include("mess_config.hrl").

  logon(Name) ->
      case whereis(mess_client) of 
	  undefined ->
	      register(mess_client, 
		       spawn(mess_client, client, [?server_node, Name]));
	  _ -> already_logged_on
      end.

  logoff() ->
      mess_client ! logoff.

  message(ToName, Message) ->
      case whereis(mess_client) of % Test if the client is running
	  undefined ->
	      not_logged_on;
	  _ -> mess_client ! #message_to{to_name=ToName, message=Message},
	       ok
      end.
  %%%----END FILE----
   #+end_src
