html/erlang/tutorial/misc/misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>杂项</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../fault-tolerance/fault-tolerance.html"> UP </a>
 |
 <a accesskey="H" href="../tutorial.html"> HOME </a>
</div><div id="content">
<h1 class="title">杂项</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc3c6eaf">拆分源码</a>
<ul>
<li><a href="#orgf08325b">服务器配置头文件</a></li>
<li><a href="#org84a9472">客户端与 messager 之间的接口定义</a></li>
<li><a href="#org35bba78">用户接口函数</a></li>
<li><a href="#org0e42c09">messager 系统客户端的函数</a></li>
<li><a href="#org642c7be">messager 服务端的函数</a></li>
<li><a href="#org1af78ae">测试</a></li>
</ul>
</li>
<li><a href="#org1d3b4f3">头文件</a></li>
<li><a href="#orge023c1a">记录</a></li>
<li><a href="#org6c3ef9a">宏</a></li>
<li><a href="#org935639c">编译和链接</a></li>
</ul>
</div>
</div>
<p>
大型程序通常会把代码拆分成一组文件，各个文件之间通过良好定义的接口来连接 
</p>

<div id="outline-container-orgc3c6eaf" class="outline-2">
<h2 id="orgc3c6eaf">拆分源码</h2>
<div class="outline-text-2" id="text-orgc3c6eaf">
<p>
现在将前面几节中 messager 程序分布到多个文件中 
</p>
</div>
<div id="outline-container-orgf08325b" class="outline-3">
<h3 id="orgf08325b">服务器配置头文件</h3>
<div class="outline-text-3" id="text-orgf08325b">
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----FILE mess_config.hrl----</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Configure the location of the server node,</span>
<span style="color: #ffd700;">-define</span>(<span style="color: #98f5ff;">server_node</span>, messenger@gentoo).

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----END FILE----</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org84a9472" class="outline-3">
<h3 id="org84a9472">客户端与 messager 之间的接口定义</h3>
<div class="outline-text-3" id="text-org84a9472">
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----FILE mess_interface.hrl----</span>

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">Message interface between client and server and client shell for</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">messenger program </span>

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">Messages from Client to server received in server/1 function.</span>
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">logon</span>,{client_pid, username}).
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">message</span>,{client_pid, to_name, message}).
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">{'EXIT', ClientPid, Reason}  (client terminated or unreachable.</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Messages from Server to Client, received in await_result/0 function </span>
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">abort_client</span>,{message}).
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Messages are: user_exists_at_other_node, </span>
<span style="color: #5f9ea0; font-style: italic;">%%%               </span><span style="color: #5f9ea0; font-style: italic;">you_are_not_logged_on</span>
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">server_reply</span>,{message}).
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Messages are: logged_on</span>
<span style="color: #5f9ea0; font-style: italic;">%%%               </span><span style="color: #5f9ea0; font-style: italic;">receiver_not_found</span>
<span style="color: #5f9ea0; font-style: italic;">%%%               </span><span style="color: #5f9ea0; font-style: italic;">sent  (Message has been sent (no guarantee)</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Messages from Server to Client received in client/1 function</span>
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">message_from</span>,{from_name, message}).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Messages from shell to Client received in client/1 function</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">spawn(mess_client, client, [server_node(), Name])</span>
<span style="color: #ffd700;">-record</span>(<span style="color: #98f5ff;">message_to</span>,{to_name, message}).
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">logoff</span>

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----END FILE----</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org35bba78" class="outline-3">
<h3 id="org35bba78">用户接口函数</h3>
<div class="outline-text-3" id="text-org35bba78">
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----FILE user_interface.erl----</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">User interface to the messenger program</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">login(Name)</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">One user at a time can log in from each Erlang node in the</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">system messenger: and choose a suitable Name. If the Name</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">is already logged in at another node or if someone else is</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">already logged in at the same node, login will be rejected</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">with a suitable error message.</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">logoff()</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">Logs off anybody at that node</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">message(ToName, Message)</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">sends Message to ToName. Error messages if the user of this </span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">function is not logged on or if ToName is not logged on at</span>
<span style="color: #5f9ea0; font-style: italic;">%%%     </span><span style="color: #5f9ea0; font-style: italic;">any node.</span>

<span style="color: #ffd700;">-module</span>(user_interface).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">logon/1</span>, <span style="color: #98f5ff;">logoff/0</span>, <span style="color: #98f5ff;">message/2</span>]).
<span style="color: #ffd700;">-include</span>(<span style="color: #deb887;">"mess_interface.hrl"</span>).
<span style="color: #ffd700;">-include</span>(<span style="color: #deb887;">"mess_config.hrl"</span>).

<span style="color: #daa520; font-weight: bold;">logon</span>(<span style="color: #4eee94;">Name</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> 
        undefined -&gt;
            <span style="color: #f08080;">register</span>(mess_client, 
                     <span style="color: #f08080;">spawn</span>(mess_client, client, [?<span style="color: #ffd700;">server_node</span>, <span style="color: #4eee94;">Name</span>]));
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>already_logged_on
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #daa520; font-weight: bold;">logoff</span>() -&gt;
    mess_client ! logoff.

<span style="color: #daa520; font-weight: bold;">message</span>(<span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Test if the client is running</span>
        undefined -&gt;
            not_logged_on;
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>mess_client ! #<span style="color: #98f5ff;">message_to</span>{to_name=<span style="color: #4eee94;">ToName</span>, message=<span style="color: #4eee94;">Message</span>},
             ok
    <span style="color: #00bfff; font-weight: bold;">end</span>.
<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----END FILE----</span>
</pre>
</div>
</div>
</div>
