html/erlang/tutorial/misc/misc.html
<div id="outline-container-org0e42c09" class="outline-3">
<h3 id="org0e42c09">messager 系统客户端的函数</h3>
<div class="outline-text-3" id="text-org0e42c09">
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----FILE mess_client.erl----</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">The client process which runs on each user node</span>

<span style="color: #ffd700;">-module</span>(mess_client).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">client/2</span>]).
<span style="color: #ffd700;">-include</span>(<span style="color: #deb887;">"mess_interface.hrl"</span>).

<span style="color: #daa520; font-weight: bold;">client</span>(<span style="color: #4eee94;">Server_Node</span>, <span style="color: #4eee94;">Name</span>) -&gt;
    {messenger, <span style="color: #4eee94;">Server_Node</span>} ! #<span style="color: #98f5ff;">logon</span>{client_pid=<span style="color: #f08080;">self</span>(), username=<span style="color: #4eee94;">Name</span>},
    <span style="color: #98f5ff;">await_result</span>(),
    <span style="color: #98f5ff;">client</span>(<span style="color: #4eee94;">Server_Node</span>).

<span style="color: #daa520; font-weight: bold;">client</span>(<span style="color: #4eee94;">Server_Node</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        logoff -&gt;
            <span style="color: #f08080;">exit</span>(normal);
        #<span style="color: #98f5ff;">message_to</span>{to_name=<span style="color: #4eee94;">ToName</span>, message=<span style="color: #4eee94;">Message</span>} -&gt;
            {messenger, <span style="color: #4eee94;">Server_Node</span>} ! 
                #<span style="color: #98f5ff;">message</span>{client_pid=<span style="color: #f08080;">self</span>(), to_name=<span style="color: #4eee94;">ToName</span>, message=<span style="color: #4eee94;">Message</span>},
            <span style="color: #98f5ff;">await_result</span>();
        {message_from, <span style="color: #4eee94;">FromName</span>, <span style="color: #4eee94;">Message</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Message from ~p: ~p~n"</span>, [<span style="color: #4eee94;">FromName</span>, <span style="color: #4eee94;">Message</span>])
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #98f5ff;">client</span>(<span style="color: #4eee94;">Server_Node</span>).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">wait for a response from the server</span>
<span style="color: #daa520; font-weight: bold;">await_result</span>() -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        #<span style="color: #98f5ff;">abort_client</span>{message=<span style="color: #4eee94;">Why</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">Why</span>]),
            <span style="color: #f08080;">exit</span>(normal);
        #<span style="color: #98f5ff;">server_reply</span>{message=<span style="color: #4eee94;">What</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">What</span>])
    <span style="color: #00bfff; font-weight: bold;">after</span> 5000 -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"No response from server~n"</span>, []),
            <span style="color: #f08080;">exit</span>(timeout)
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----END FILE---</span>
</pre>
</div>
</div>
</div>
