html/erlang/tutorial/misc/misc.html
<div id="outline-container-org642c7be" class="outline-3">
<h3 id="org642c7be">messager 服务端的函数</h3>
<div class="outline-text-3" id="text-org642c7be">
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----FILE mess_server.erl----</span>

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">This is the server process of the messenger service</span>

<span style="color: #ffd700;">-module</span>(mess_server).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">start_server/0</span>, <span style="color: #98f5ff;">server/0</span>]).
<span style="color: #ffd700;">-include</span>(<span style="color: #deb887;">"mess_interface.hrl"</span>).

<span style="color: #daa520; font-weight: bold;">server</span>() -&gt;
    <span style="color: #f08080;">process_flag</span>(trap_exit, true),
    <span style="color: #98f5ff;">server</span>([]).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">the user list has the format [{ClientPid1, Name1},{ClientPid22, Name2},...]</span>
<span style="color: #daa520; font-weight: bold;">server</span>(<span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"User list = ~p~n"</span>, [<span style="color: #4eee94;">User_List</span>]),
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        #<span style="color: #98f5ff;">logon</span>{client_pid=<span style="color: #4eee94;">From</span>, username=<span style="color: #4eee94;">Name</span>} -&gt;
            <span style="color: #4eee94;">New_User_List</span> = <span style="color: #98f5ff;">server_logon</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">New_User_List</span>);
        {<span style="color: #deb887;">'EXIT'</span>, <span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">_</span>} -&gt;
            <span style="color: #4eee94;">New_User_List</span> = <span style="color: #98f5ff;">server_logoff</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">New_User_List</span>);
        #<span style="color: #98f5ff;">message</span>{client_pid=<span style="color: #4eee94;">From</span>, to_name=<span style="color: #4eee94;">To</span>, message=<span style="color: #4eee94;">Message</span>} -&gt;
            <span style="color: #98f5ff;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">User_List</span>)
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Start the server</span>
<span style="color: #daa520; font-weight: bold;">start_server</span>() -&gt;
    <span style="color: #f08080;">register</span>(messenger, <span style="color: #f08080;">spawn</span>(?<span style="color: #ffd700;">MODULE</span>, server, [])).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server adds a new user to the user list</span>
<span style="color: #daa520; font-weight: bold;">server_logon</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">check if logged on anywhere else</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keymember</span>(<span style="color: #4eee94;">Name</span>, 2, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        true -&gt;
            <span style="color: #4eee94;">From</span> ! #<span style="color: #98f5ff;">abort_client</span>{message=user_exists_at_other_node},
            <span style="color: #4eee94;">User_List</span>;
        false -&gt;
            <span style="color: #4eee94;">From</span> ! #<span style="color: #98f5ff;">server_reply</span>{message=logged_on},
            <span style="color: #f08080;">link</span>(<span style="color: #4eee94;">From</span>),
            [{<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>} | <span style="color: #4eee94;">User_List</span>]        <span style="color: #5f9ea0; font-style: italic;">%</span><span style="color: #5f9ea0; font-style: italic;">add user to the list</span>
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server deletes a user from the user list</span>
<span style="color: #daa520; font-weight: bold;">server_logoff</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keydelete</span>(<span style="color: #4eee94;">From</span>, 1, <span style="color: #4eee94;">User_List</span>).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server transfers a message between user</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">check that the user is logged on and who he is</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">From</span>, 1, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! #<span style="color: #98f5ff;">abort_client</span>{message=you_are_not_logged_on};
        {value, {<span style="color: #4eee94;">_</span>, <span style="color: #4eee94;">Name</span>}} -&gt;
            <span style="color: #98f5ff;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>)
    <span style="color: #00bfff; font-weight: bold;">end</span>.
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">If the user exists, send the message</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">Find the receiver and send the message</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">To</span>, 2, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! #<span style="color: #98f5ff;">server_reply</span>{message=receiver_not_found};
        {value, {<span style="color: #4eee94;">ToPid</span>, <span style="color: #4eee94;">To</span>}} -&gt;
            <span style="color: #4eee94;">ToPid</span> ! #<span style="color: #98f5ff;">message_from</span>{from_name=<span style="color: #4eee94;">Name</span>, message=<span style="color: #4eee94;">Message</span>}, 
            <span style="color: #4eee94;">From</span> !  #<span style="color: #98f5ff;">server_reply</span>{message=sent} 
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%%</span><span style="color: #5f9ea0; font-style: italic;">----END FILE---</span>
</pre>
</div>
</div>
</div>
